//將工作流程的敘述寫在這裡
const w_description = [
    {
        "服務名稱": "客變費用",
        "服務說明": {
            "前期準備": [
                "與建商索取CAD檔等相關資料。"
            ],
            "初步討論": [
                "介紹服務流程，細談客戶需求。"
            ],
            "簽訂合約": [
                "初步討論完成後三日內，\\n簽訂客變合約即可享有8折優惠。"
            ],
            "平面提案": [
                "依據業主需求提供多種平面配置圖，\\n於下次會議討論選擇及調整。"
            ],
            "繪製圖面": [
                "平面定案後，繪製後續相關水電圖面。"
            ],
            "建商客變": [
                "完成上述圖面後，\\n設計師會協助業主與建商完成客變事項。"
            ]
        },
        "費用說明": "$2500 / 坪 優惠費用 $2000 / 坪 60%訂金 40%尾款 / 以10坪做最低計費"
    },
    {
        "服務名稱": "設計費用",
        "服務說明": {
            "預約諮詢": [
                "電話後預約時間到門市前做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "提供CAD檔(若無CAD檔，則須安排丈量)。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全案3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。",
                "屋主需先向管委會繳交裝潢保證金及大樓清潔費。",
                "施作外區保護工程，經管理中心檢查確認。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "$5000 / 坪 優惠費用 $4000 / 坪 80%訂金 20%尾款 / 以10坪做最低計費"
    },
    {
        "服務名稱": "監管費用",
        "服務說明": {
            "預約諮詢": [
                "電話後預約時間到門市前做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "安排丈量時間。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全景3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。",
                "屋主需先向管委會繳交裝潢保證金及大樓清潔費。",
                "施作外區保護工程，經管理中心檢查確認。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "總工程款 10% / 保固一年"
    },
    {
        "服務名稱": "商業空間",
        "服務說明": {
            "預約諮詢": [
                "電話後預約時間到門市做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "安排丈量時間。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全景3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "視個案需求，坪數大小而定，將以專案另計"
    }
];

// 將 description 轉換為 JSON 字串後存儲到 localStorage 中
localStorage.setItem('workflow_description', JSON.stringify(w_description));