//將工作流程的敘述寫在這裡
const w_description = [
    {
        "服務名稱": "新成屋裝修",
        "服務說明": {
            "預約諮詢1": [
                "電話預約或填寫預約表單時間到門市前做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "提供CAD檔(若無CAD檔，則須安排丈量)。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全案3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。",
                "屋主需先向管委會繳交裝潢保證金及大樓清潔費。",
                "施作外區保護工程，經管理中心檢查確認。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "$5000 / 坪 優惠費用 $4000 / 坪 80%訂金 20%尾款/ 監工費 10%"
    },
    {
        "服務名稱": "新成屋裝修2",
        "服務說明": {
            "預約諮詢2": [
                "電話預約或填寫預約表單時間到門市前做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "提供CAD檔(若無CAD檔，則須安排丈量)。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全案3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。",
                "屋主需先向管委會繳交裝潢保證金及大樓清潔費。",
                "施作外區保護工程，經管理中心檢查確認。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "$2500 / 坪 優惠費用 $2000 / 坪 60%訂金 40%尾款"
    },
    {
        "服務名稱": "新成屋裝修3",
        "服務說明": {
            "預約諮詢3": [
                "電話預約或填寫預約表單時間到門市前做諮詢。",
                "了解需求及喜好風格。",
                "設計費、工程管理費及服務流程說明。",
                "提供CAD檔(若無CAD檔，則須安排丈量)。"
            ],
            "提案及設計作業": [
                "平面配置及風格簡報介紹。",
                "簽訂設計合約。",
                "繪製全案3D圖。",
                "平面系統圖及工程報價單。",
                "簽訂工程合約。"
            ],
            "開工前作業": [
                "確認立面圖及材質。",
                "施工進度表確認。",
                "申請室內裝修許可證。",
                "屋主需先向管委會繳交裝潢保證金及大樓清潔費。",
                "施作外區保護工程，經管理中心檢查確認。"
            ],
            "裝修工程流程": [
                "施工品項核對。",
                "依施工進度表進行工項。"
            ],
            "完工驗收": [
                "清潔後完工驗收。",
                "保固期1年。"
            ]
        },
        "費用說明": "視個案需求，坪數大小而定，將以專案另計"
    },
];

// 將 description 轉換為 JSON 字串後存儲到 localStorage 中
localStorage.setItem('workflow_description', JSON.stringify(w_description));